<a href="https://colab.research.google.com/github/robsonbfreitas/DataManipulationExercises/blob/main/Manipulacao_de_Dados_Ex_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

![](https://i.imgur.com/JsMvGnP.png)


## Exercícios de manipulação de dados - Parte 1

Neste Jupyter notebook você irá resolver uma exercícios utilizando a biblioteca Pandas.\
Todos os datasets utilizados nos exercícios estão salvos na pasta *datasets*.\
Todo o seu código deve ser executado neste Jupyter Notebook. Por fim, se desejar, revise as respostas com o seu mentor.

In [2]:
import pandas as pd

#### Passo 1. Importando os dados

Carregue os dados salvos no arquivo ***datasets/users_dataset.csv***.\
Esse arquivo possui um conjunto de dados de trabalhadores com 5 colunas separadas pelo símbolo "|" (pipe) e 943 linhas.

Dica: não se esqueça do argumento *sep* quando importar os dados.

In [4]:
users = pd.read_csv('datasets/users_dataset.csv', sep='|')
users

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

#### Passo 2. Mostre as 15 primeiras linhas do dataset.

*Dica: utilize a função head do DataFrame*

In [5]:
users.head(15)

    user_id  age gender     occupation zip_code
0         1   24      M     technician    85711
1         2   53      F          other    94043
2         3   23      M         writer    32067
3         4   24      M     technician    43537
4         5   33      F          other    15213
5         6   42      M      executive    98101
6         7   57      M  administrator    91344
7         8   36      M  administrator    05201
8         9   29      M        student    01002
9        10   53      M         lawyer    90703
10       11   39      F          other    30329
11       12   28      F          other    06405
12       13   47      M       educator    29206
13       14   45      M      scientist    55106
14       15   49      F       educator    97301

#### Passo 3. Mostre as 10 últimas linhas do dataset

In [ ]:
# Seu código

#### Passo 4. Qual o número de linhas e colunas do DataFrame?

In [ ]:
# Seu código

#### Passo 5. Mostre o nome de todas as colunas.

In [ ]:
# Seu código

#### Passo 6. Qual o tipo de dado de cada columa?

In [ ]:
# Seu código

#### Passo 7. Mostre os dados da coluna *occupation*.

In [ ]:
# Seu código

#### Passo 8. Quantas ocupações diferentes existem neste dataset?

In [ ]:
# Seu código

#### Passo 9. Qual a ocupação mais frequente?

In [ ]:
# Seu código

#### Passo 10. Qual a idade média dos usuários?

In [ ]:
# Seu código

#### Passo 11. Utilize o método describe() para obter diversas informações a respeito do DataFrame.

In [ ]:
# Seu código

**Parabéns! Você chegou ao fim!**